In [7]:
import pandas as pd
df=pd.read_csv("D:\\data\\prdicPrice.csv")
df

                 CarModel  Mileage  SellPrice  Age
0                  BMW X5    69000      18000    6
1                  BMW X5    35000      34000    3
2                  BMW X5    57000      26100    5
3                  BMW X5    22500      40000    2
4                  BMW X5    46000      31500    4
5                 Audi A5    59000      29400    5
6                 Audi A5    52000      32000    5
7                 Audi A5    72000      19300    6
8                 Audi A5    91000      12000    8
9   Mercedez Benz C class    67000      22000    6
10  Mercedez Benz C class    83000      20000    7
11  Mercedez Benz C class    79000      21000    7
12  Mercedez Benz C class    59000      33000    5

In [9]:
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import LabelEncoder
Le=LabelEncoder()
dfnew=df
dfnew.CarModel=Le.fit_transform(df.CarModel)
dfnew

    CarModel  Mileage  SellPrice  Age
0          1    69000      18000    6
1          1    35000      34000    3
2          1    57000      26100    5
3          1    22500      40000    2
4          1    46000      31500    4
5          0    59000      29400    5
6          0    52000      32000    5
7          0    72000      19300    6
8          0    91000      12000    8
9          2    67000      22000    6
10         2    83000      20000    7
11         2    79000      21000    7
12         2    59000      33000    5

In [15]:
Lr=LinearRegression()
X=dfnew[['CarModel','Mileage','Age']].values
X

array([[    1, 69000,     6],
       [    1, 35000,     3],
       [    1, 57000,     5],
       [    1, 22500,     2],
       [    1, 46000,     4],
       [    0, 59000,     5],
       [    0, 52000,     5],
       [    0, 72000,     6],
       [    0, 91000,     8],
       [    2, 67000,     6],
       [    2, 83000,     7],
       [    2, 79000,     7],
       [    2, 59000,     5]], dtype=int64)

In [14]:
y=dfnew.SellPrice
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: SellPrice, dtype: int64

In [19]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
ct=ColumnTransformer([("CarModel",OneHotEncoder(),[0])],remainder="passthrough")
X_ohe=ct.fit_transform(X)
X_ohe

array([[0.00e+00, 1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [20]:
X_new=X_ohe[:,1:]
X_new

array([[1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [21]:
Lr.fit(X_new,y)

LinearRegression()

In [24]:
Lr.predict([[0,1,45000,4]])#Price of mercedez benz that is 4 yr old with mileage 45000

array([36991.31721062])

In [25]:
Lr.predict([[1,0,86000,7]])#Price of BMW X5 that is 7 yr old with mileage 86000

array([11080.74313219])